#Нещерет Максим КІ-1 (1 варіант)
def print_large_digit(num):
    #цифри з символів "#"
    large_digits = {
        '0': ["###", "# #", "# #", "# #", "###"],
        '1': ["  #", "  #", "  #", "  #", "  #"],
        '2': ["###", "  #", "###", "#  ", "###"],
        '3': ["###", "  #", "###", "  #", "###"],
        '4': ["# #", "# #", "###", "  #", "  #"],
        '5': ["###", "#  ", "###", "  #", "###"],
        '6': ["###", "#  ", "###", "# #", "###"],
        '7': ["###", "  #", "  #", "  #", "  #"],
        '8': ["###", "# #", "###", "# #", "###"],
        '9': ["###", "# #", "###", "  #", "###"],
    }

    num_str = str(num)
    for i in range(5):
        for digit in num_str:
            print(large_digits[digit][i], end="  ")
        print()

try:
    number = int(input("Введіть ціле число: "))
    print_large_digit(number)
except ValueError:
    print("Ви ввели не ціле число.")
